results-shopcart-harness_2_0_0-jvm-shenandoah-run/result-2026-01-05-18:25:36/wrk2_results_20260105_182539.txt
Running 30s test @ http://shopcart:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 2.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.020ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.788ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.942ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.989ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.841ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.760ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.861ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.858ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.648ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.583ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.621ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.672ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.609ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.498ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.495ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  425.29us   3.23ms   66.65%
    Req/Sec    52.82     52.50   111.00     78.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.58ms
 90.000%    1.86ms
 99.000%    2.34ms
 99.900%    2.57ms
 99.990%    2.83ms
 99.999%    3.23ms
100.000%    3.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.245     0.000000            1         1.00
       0.742     0.100000         1603         1.11
       0.907     0.200000         3205         1.25
       1.044     0.300000         4792         1.43
       1.164     0.400000         6392         1.67
       1.281     0.500000         7996         2.00
       1.334     0.550000         8785         2.22
       1.391     0.600000         9590         2.50
       1.447     0.650000        10387         2.86
       1.512     0.700000        11196         3.33
       1.576     0.750000        11983         4.00
       1.609     0.775000        12381         4.44
       1.648     0.800000        12784         5.00
       1.690     0.825000        13180         5.71
       1.740     0.850000        13588         6.67
       1.791     0.875000        13976         8.00
       1.824     0.887500        14177         8.89
       1.857     0.900000        14374        10.00
       1.895     0.912500        14575        11.43
       1.937     0.925000        14777        13.33
       1.985     0.937500        14975        16.00
       2.007     0.943750        15073        17.78
       2.036     0.950000        15174        20.00
       2.077     0.956250        15279        22.86
       2.103     0.962500        15376        26.67
       2.137     0.968750        15472        32.00
       2.159     0.971875        15523        35.56
       2.181     0.975000        15574        40.00
       2.205     0.978125        15624        45.71
       2.229     0.981250        15672        53.33
       2.255     0.984375        15722        64.00
       2.275     0.985938        15747        71.11
       2.303     0.987500        15772        80.00
       2.331     0.989062        15798        91.43
       2.351     0.990625        15824       106.67
       2.371     0.992188        15847       128.00
       2.381     0.992969        15860       142.22
       2.399     0.993750        15873       160.00
       2.407     0.994531        15884       182.86
       2.435     0.995313        15897       213.33
       2.455     0.996094        15909       256.00
       2.467     0.996484        15916       284.44
       2.479     0.996875        15923       320.00
       2.487     0.997266        15928       365.71
       2.517     0.997656        15934       426.67
       2.521     0.998047        15941       512.00
       2.527     0.998242        15943       568.89
       2.543     0.998437        15947       640.00
       2.553     0.998633        15950       731.43
       2.563     0.998828        15953       853.33
       2.579     0.999023        15956      1024.00
       2.599     0.999121        15957      1137.78
       2.605     0.999219        15959      1280.00
       2.625     0.999316        15962      1462.86
       2.625     0.999414        15962      1706.67
       2.697     0.999512        15964      2048.00
       2.697     0.999561        15964      2275.56
       2.707     0.999609        15965      2560.00
       2.717     0.999658        15966      2925.71
       2.777     0.999707        15967      3413.33
       2.807     0.999756        15968      4096.00
       2.807     0.999780        15968      4551.11
       2.807     0.999805        15968      5120.00
       2.825     0.999829        15969      5851.43
       2.825     0.999854        15969      6826.67
       2.843     0.999878        15970      8192.00
       2.843     0.999890        15970      9102.22
       2.843     0.999902        15970     10240.00
       2.843     0.999915        15970     11702.86
       2.843     0.999927        15970     13653.33
       3.229     0.999939        15971     16384.00
       3.229     1.000000        15971          inf
#[Mean    =        1.293, StdDeviation   =        0.425]
#[Max     =        3.228, Total count    =        15971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24003 requests in 29.97s, 11.88MB read
  Non-2xx or 3xx responses: 11961
Requests/sec:    800.82
Transfer/sec:    405.78KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 0
Total errors (4xx/5xx): 0

Status code distribution:

Histogram data written to: /wrktemp/results/response_histogram.json